# 1) Создать переменную типа String
print("1) Создать переменную типа String")
a = "Srt"
print("a =", a, "-", type(a))
print()

# 2) Создать переменную типа Integer
print("2) Создать переменную типа Integer")
b = 10
print("b =", b, "-", type(b))
print()

# 3) Создать переменную типа Float
print("3) Создать переменную типа Float")
c = 2.5
print("c =", c, "-", type(c))
print()

# 4) Создать переменную типа Bytes
print("4) Создать переменную типа Bytes")
d = bytes(5)
print("d =", d, "-", type(d))
print()

# 5) Создать переменную типа List
print("5) Создать переменную типа List")
e = [1,2,3,4]
print("e =", e, "-", type(e))
print()

# 6) Создать переменную типа Tuple
print("6) Создать переменную типа Tuple")
f = (10, "Mir", 8)
g = (25, 56, 3)
print("f =", f, "-", type(f))
print("g =", g, "-", type(g))
print()

# 7) Создать переменную типа Set
print("7) Создать переменную типа Set")
h = {3, 5, 8, 12, 200}
print("h =", h, "-", type(h))
print()

# 8) Создать переменную типа Frozen set
print("8. Создать переменную типа Frozen set")
k = frozenset([15, 52, 8, 500, 2.5, 5.8, 9])
print("k =", k, "-", type(k))
print()

# 9) Создать переменную типа Dict
print("9) Создать переменную типа Dict")
l = dict({'a': 1, 'b': 2, 'c': 3})
print("l =", l, "-", type(l))
print()

# 10) Вывести в консоль все выше перечисленные переменные с добавлением типа данных.
print("10) Вывести в консоль все выше перечисленные переменные с добавлением типа данных.")
print()
print("a =", a, "-", type(a))
print("b =", b, "-", type(b))
print("c =", c, "-", type(c))
print("d =", d, "-", type(d))
print("e =", e, "-", type(e))
print("f =", f, "-", type(f))
print("g =", g, "-", type(g))
print("h =", h, "-", type(h))
print("k =", k, "-", type(k))
print("l =", l, "-", type(l))
print()

# 11) Создать 2 переменные String, создать переменную в которой сканкатенируете эти переменные. Вывести в консоль.
print("11) Создать 2 переменные String, создать переменную в которой сканкатенируете эти переменные. Вывести в консоль.")
str1 = "Hi "
str2 = "Mir"
str3 = str1 + str2
print(str3)
print()

# 12) Вывести в одну строку переменные типа String и Integer используя “,” (Запятую)
print("12) Вывести в одну строку переменные типа String и Integer используя “,” (Запятую)")
string11 = "Август"
n = 2023
print(n, string11)
print()

# 13) Вывести в одну строку переменные типа String и Integer используя “+” (Плюс)
print("13) Вывести в одну строку переменные типа String и Integer используя “+” (Плюс)")
lk = "1255462"
ll = " - серийный номер"
print(lk + ll)
