line ="----------------------------------------------------------------------------------------------------------------------------------------"
# 1. Создать переменную int_item со значением 10
print("1. Создать переменную int_item со значением 10")
int_item = 10
print("int_item =", int_item)
print(line)

# 2. Создать переменную comp_item со значением 18
print("2. Создать переменную comp_item со значением 18")
comp_item = 18
print("comp_item =", comp_item,)
print(line)

# 3. Создать переменную mult_int в которй умножите int_item на 2
print("3. Создать переменную mult_int в которй умножите int_item на 2")
mult_int = int_item * 2
print("mult_int =", mult_int)
print(line)

# 4. Создать переменную item_2 со значением True
print("4. Создать переменную item_2 со значением True")
item_2 = True
print("item_2 =", item_2)
print(line)

# 5. Создать переменную item_3 со значением False
print("5. Создать переменную item_3 со значением False")
item_3 = False
print("item_3 =", item_3)
print(line)

# 6. Создать переменную item_4 со значением 0
print("6. Создать переменную item_4 со значением 0")
item_4 = 0
print("item_4 =", item_4)
print(line)

# 7. Создать переменную item_5 со значением 1
print("7. Создать переменную item_5 со значением 1")
item_5 = 1
print("item_5 =", item_5)
print(line)

# 8. Создать переменную usd_item со значением ‘usd’
print("8. Создать переменную usd_item со значением ‘usd’")
usd_item = "usd"
print("usd_item =", usd_item)
print(line)

# 9. Создать переменную usd_usd_rate со значением 1
print("9. Создать переменную usd_usd_rate со значением 1")
usd_usd_rate = 1
print("usd_usd_rate =", usd_usd_rate)
print(line)

# 10. Создать переменную eur_item со значением ‘eur’
print("10. Создать переменную eur_item со значением ‘eur’")
eur_item = "eur"
print("eur_item =", eur_item)
print(line)

# 11. Создать переменную usd_eur_rate со значением 0.86
print("11. Создать переменную usd_eur_rate со значением 0.86")
usd_eur_rate = 0.86
print("usd_eur_rate =", usd_eur_rate)
print(line)

# 12. Создать переменную uah_item со значением ‘uah’
print("12. Создать переменную uah_item со значением ‘uah’")
uah_item = "uah"
print("uah_item =", uah_item)
print(line)

# 13. Создать переменную usd_uah_rate со значением 26.23
print("13. Создать переменную usd_uah_rate со значением 26.23")
usd_uah_rate = 26.23
print("usd_uah_rate =", usd_uah_rate)
print(line)

# 14. Создать переменную chf_item со значением ‘chf’
print("14. Создать переменную chf_item со значением ‘chf’")
chf_item = "chf"
print("chf_item =", chf_item)
print(line)

# 15. Создать переменную usd_chf_rate со значением 0.91
print("15. Создать переменную usd_chf_rate со значением 0.91")
usd_chf_rate = 0.91
print("usd_chf_rate =", usd_chf_rate)
print(line)

# 16. Создать переменную rub_item со значением ‘rub’
print("16. Создать переменную rub_item со значением ‘rub’")
rub_item = "rub"
print("rub_item =", rub_item)
print(line)

# 17. Создать переменную usd_rub_rate со значением 71.88
print("17. Создать переменную usd_rub_rate со значением 71.88")
usd_rub_rate = 71.88
print("usd_rub_rate =", usd_rub_rate)
print(line)

# 18. Создать переменную byn_item со значением ‘byn’
print("18. Создать переменную byn_item со значением ‘byn’")
byn_item = "byn"
print("byn_item =", byn_item)
print(line)

# 19. Создать переменную usd_byn_rate со значением 2.46
print("19. Создать переменную usd_byn_rate со значением 2.46")
usd_byn_rate = 2.46
print("usd_byn_rate =", usd_byn_rate)
print(line)

# 20. Сделать if в котором будет условие: если mult_int больше comp_item, то вывести в консоль (“Переменная mult_int больше”, comp_item)
print("20. Сделать if в котором будет условие: если mult_int больше comp_item, то вывести в консоль (“Переменная "
      "mult_int больше”, comp_item)")

if mult_int > comp_item:
    print("Переменная mult_int больше", comp_item)
print(line)

# 21. Создать переменную div_int в которй разделить int_item на 2
print("21. Создать переменную div_int в которй разделить int_item на 2")
div_int = int_item / 2
print("div_int =", div_int)
print(line)

# 22. Сделать if в котором будет условие: если div_int меньше comp_item, то вывести в консоль (“Переменная div_int меньше”, comp_item)
print("22. Сделать if в котором будет условие: если div_int меньше comp_item, то вывести в консоль (“Переменная div_int меньше”, comp_item)")

if div_int < comp_item:
    print("Переменная div_int меньше", comp_item)
print(line)

# 23. Создать переменную item_1 в которй прибавить 10 к переменной int_item
print("23. Создать переменную item_1 в которй прибавить 10 к переменной int_item")
item_1 = int_item + 10
print("item_1 =", item_1)
print(line)

# 24. Сделать if в котором будет условие: если item_1 меньше comp_item, то вывести в консоль
# (“Переменная item_1 меньше”, comp_item), иначе, вывести в консоль (“Переменная item_1 больше или равна”, comp_item)
print("24. Сделать if в котором будет условие: если item_1 меньше comp_item, то вывести в консоль ")
print(("Переменная item_1 меньше”, comp_item), иначе, вывести в консоль (“Переменная item_1 больше или равна”, comp_item)"))
print()

if item_1 < comp_item:
    print("Переменная item_1 меньше", comp_item)
else:
    print("Переменная item_1 больше или равна", comp_item)
print(line)

# 25. Сделать if в котором будет условие: если item_2, то вывести в консоль (“Переменная item_2 = ”, item_2), иначе,
# вывести в консоль (“Переменная item_2 = ”, item_3)
print("25. Сделать if в котором будет условие: если item_2, то вывести в консоль (“Переменная item_2 = ”, item_2), иначе, ")
print("вывести в консоль (“Переменная item_2 = ”, item_3)")

if item_2:
    print("Переменная item_2 =", item_2)
else:
    print("Переменная item_2 =", item_3)
print(line)

# 26. Сделать if в котором будет условие: если item_3, то вывести в консоль (“Переменная item_3 = ”, item_2),
# иначе, вывести в консоль (“Переменная item_3 = ”, item_3)
print("26. Сделать if в котором будет условие: если item_3, то вывести в консоль (“Переменная item_3 = ”, item_2), "
      "иначе, вывести в консоль (“Переменная item_3 = ”, item_3)")

if item_3:
    print("Переменная item_3 =", item_2)
else:
    print("Переменная item_3 =", item_3)
print(line)

# 27. Сделать if в котором будет условие: если item_5, то вывести в консоль (“Переменная item_5 = ”, item_5),
# иначе, вывести в консоль (“Переменная item_5 = ”, item_4)
print("27. Сделать if в котором будет условие: если item_5, то вывести в консоль (“Переменная item_5 = ”, item_5), "
      "иначе, вывести в консоль (“Переменная item_5 = ”, item_4)")

if item_5:
    print("Переменная item_5 =", item_5)
else:
    print("Переменная item_5 =", item_4)
print(line)

# 28. Сделать if в котором будет условие: если item_4, то вывести в консоль (“Переменная item_4 = ”, item_5),
# иначе, вывести в консоль (“Переменная item_4 = ”, item_4)
print("28. Сделать if в котором будет условие: если item_4, то вывести в консоль (“Переменная item_4 = ”, item_5), "
      "иначе, вывести в консоль (“Переменная item_4 = ”, item_4)")

if item_4:
    print("Переменная item_4 =", item_5)
else:
    print("Переменная item_4 =", item_4)
print(line)

# 29. Создать переменную currency_convertor со значением item_2
print("29. Создать переменную currency_convertor со значением item_2")
currency_convertor = item_2
print("currency_convertor =", currency_convertor)
print(line)

# 30. Сделать if в котором будет условие: если currency_convertor, то выполнять следующие шаги задания,
# иначе, вывести в консоль (“Переменная currency_convertor = ”, item_3)
# 31. Внутри if currency_convertor сделать следующие If условия :
#                     31.1 Создать переменную currency_usd со значением usd_item
#                     31.2 Создать переменную target_currency со значением eur_item
#                     31.3 Создать переменную target_currency_amount значением 50
#                     31.4 Создать переменную currency_result со значением 0
# 31.4 Сделать if в котором будет условие: если target_currency равен ‘eur’, то в теле этого if в
# значении переменной currency_result высчитать сколько долларов получится при target_currency_amount и usd_eur_rate.
# Результат вывести в консоль (target_currency_amount, eur_item, “=”, currency_result, usd_item)
# 31.5 Сделать elif в котором будет условие: если target_currency равен ‘uah’, то в теле этого if в значении переменной
# currency_result высчитать сколько долларов получится при target_currency_amount и usd_uah_rate. Результат вывести
# в консоль (target_currency_amount, uah_item, “=”, currency_result, uah_item)
# 31.6 Сделать elif с остальными валютами
# 31.7 Последним оставить else, при выполнений которого в консоль выведется (“Unknow currency”)

if currency_convertor:
    currency_usd = usd_item
    target_currency = eur_item
    target_currency_amount = 50
    currency_result = 0
    if target_currency == usd_eur_rate:
        currency_result = target_currency_amount / usd_eur_rate
        print(target_currency_amount, eur_item, "=", currency_result, usd_item)
    elif target_currency == "uah":
        currency_result = target_currency_amount / usd_uah_rate
        print(target_currency_amount, uah_item, "=", currency_result, uah_item)
    else:
        print("Unknow currency")
else:
    print("Переменная currency_convertor = ", item_3)